Revit 2027 API
ExtendedPropertiesLinkLoadContent Class
 Represents the data needed to establish or update an ExtendedPropertiesLink. To be used as the result of invoking an external server in order to update or create an ExtendedPropertiesLink.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceLoadContent
 Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkLoadContent
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedPropertiesLinkLoadContent : ExternalResourceLoadContent
Public Class ExtendedPropertiesLinkLoadContent
	Inherits ExternalResourceLoadContent
public ref class ExtendedPropertiesLinkLoadContent : public ExternalResourceLoadContent
type ExtendedPropertiesLinkLoadContent =
    class
        inherit ExternalResourceLoadContent
    end
The ExtendedPropertiesLinkLoadContent type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ExternalResourceLoadContent)
LoadStatus |  A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
(Inherited from ExternalResourceLoadContent)
Version |  The version of the external data that the server is providing in this object.
(Inherited from ExternalResourceLoadContent)
Top
Methods
Name | Description
Dispose
(Inherited from ExternalResourceLoadContent)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExtendedPropertiesLinkData |  Sets the extended properties data from the external server.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace